package com.boot.integration.listener;

import org.springframework.context.annotation.Bean;
import org.springframework.context.annotation.Configuration;

/**
 * 
 * <pre>
 * <一句话功能简述>
 *监听服务配置类
 * <功能详细描述>
 * </pre>
 * 
 * @author xiongwei
 * @version [版本号, 2017年7月29日]
 * @see [相关类/方法]
 * @since [产品/模块版本]
 */
@Configuration
public class ListenerConfig
{
    
    /* ======================================================================== */
    /* * * * * * * * * * * * * * * Public Fields (公共属性) * * * * * * * * * */
    /* ======================================================================== */
    
    /* ======================================================================== */
    /*
     *  * * * * * * * * * * * * * * Private Fields (私有属性) * * * * * * * * * / /*
     * ========================================================================
     */
    
    /* ======================================================================== */
    /*
     *  * * * * * * * * * * * * * * Construct Methods (构造方法) * * * * * * * / /*
     * ========================================================================
     */
    
    /* ======================================================================== */
    /*
     *  * * * * * * * * * * * * * * Public Methods (公有方法) * * * * * * * * * / /*
     * ========================================================================
     */
    @Bean
    public ApplicationStartListener applicationStartListener()
    {
        return new ApplicationStartListener();
    }
    
    /* ======================================================================== */
    /*
     *  * * * * * * * * * * * * * * Private Methods (私有方法) * * * * * ** * * / /*
     * ========================================================================
     */
    
}
